-- Индексы для таблицы МАРШРУТ
CREATE INDEX idx_маршрут_станция_начала ON маршрут(станция_начала);
CREATE INDEX idx_маршрут_станция_конца ON маршрут(станция_конца);

-- Индексы для таблицы ОСТАНОВКА_НА_МАРШРУТЕ
CREATE INDEX idx_остановка_маршрут ON остановка_на_маршруте(код_маршрута);
CREATE INDEX idx_остановка_станция ON остановка_на_маршруте(код_станции);

-- Индексы для таблицы РЕЙС
CREATE INDEX idx_рейс_маршрут ON рейс(код_маршрута);
CREATE INDEX idx_рейс_дата ON рейс(дата_отправления);

-- Индексы для таблицы БИЛЕТ
CREATE INDEX idx_билет_пассажир ON билет(паспорт_пассажира);
CREATE INDEX idx_билет_рейс ON билет(номер_рейса, дата_отправления_рейса);
CREATE INDEX idx_билет_дата_покупки ON билет(дата_покупки);

-- Индексы для таблицы СОСТАВ_ПОЕЗДА
CREATE INDEX idx_состав_рейс ON состав_поезда(номер_рейса, дата_отправления);

-- Индексы для таблицы ВАГОН_В_СОСТАВЕ
CREATE INDEX idx_вагон_в_составе_состав ON вагон_в_составе(id_состава);
CREATE INDEX idx_вагон_в_составе_вагон ON вагон_в_составе(номер_вагона);

-- Индексы для таблицы НАЗНАЧЕНИЕ_ЛОКОМОТИВА
CREATE INDEX idx_назначение_рейс ON назначение_локомотива(номер_рейса, дата_отправления);
CREATE INDEX idx_назначение_локомотив ON назначение_локомотива(id_локомотива);

-- Индексы для таблицы ПАССАЖИР
CREATE INDEX idx_пассажир_фио ON пассажир(фио);
